In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame

In [2]:
dframe = DataFrame({'k1':list('xxyyz'),
                   'k2':list('ababa'),
                   'dataset1':np.random.randn(5),
                   'dataset2':np.random.randn(5)})

In [3]:
dframe

   dataset1  dataset2 k1 k2
0 -0.158972 -0.888624  x  a
1 -1.191138 -0.924377  x  b
2 -0.781172  1.409055  y  a
3  0.699610  0.577400  y  b
4 -0.670863 -1.566093  z  a

In [4]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [5]:
group1

In [6]:
group1.mean()

k1
x   -0.675055
y   -0.040781
z   -0.670863
Name: dataset1, dtype: float64

In [7]:
cities = np.array(['ny','la','la','ny','ny'])

In [8]:
month = np.array(['jan','feb','jan','feb','jan'])

In [9]:
dframe

   dataset1  dataset2 k1 k2
0 -0.158972 -0.888624  x  a
1 -1.191138 -0.924377  x  b
2 -0.781172  1.409055  y  a
3  0.699610  0.577400  y  b
4 -0.670863 -1.566093  z  a

In [10]:
dframe['dataset1'].groupby([cities,month]).mean()

la  feb   -1.191138
    jan   -0.781172
ny  feb    0.699610
    jan   -0.414917
Name: dataset1, dtype: float64

In [11]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
x  -0.675055 -0.906500
y  -0.040781  0.993228
z  -0.670863 -1.566093

In [12]:
dframe.groupby(['k1','k2']).mean()

       dataset1  dataset2
k1 k2
x  a  -0.158972 -0.888624
   b  -1.191138 -0.924377
y  a  -0.781172  1.409055
   b   0.699610  0.577400
z  a  -0.670863 -1.566093

In [13]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

In [14]:
dataset2_group.mean()

       dataset2
k1 k2
x  a  -0.888624
   b  -0.924377
y  a   1.409055
   b   0.577400
z  a  -1.566093

In [15]:
dframe.groupby(['k1']).size()

k1
x    2
y    2
z    1
dtype: int64

In [18]:
for name, group in dframe.groupby('k1'):
    print('This is the {} group'.format(name))
    print(group)
    print('\n')

This is the x group
   dataset1  dataset2 k1 k2
0 -0.158972 -0.888624  x  a
1 -1.191138 -0.924377  x  b


This is the y group
   dataset1  dataset2 k1 k2
2 -0.781172  1.409055  y  a
3  0.699610  0.577400  y  b


This is the z group
   dataset1  dataset2 k1 k2
4 -0.670863 -1.566093  z  a

In [19]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
    print('Key1 = {} key2 = {}'.format(k1,k2))
    print(group)
    print('\n')

Key1 = x key2 = a
   dataset1  dataset2 k1 k2
0 -0.158972 -0.888624  x  a


Key1 = x key2 = b
   dataset1  dataset2 k1 k2
1 -1.191138 -0.924377  x  b


Key1 = y key2 = a
   dataset1  dataset2 k1 k2
2 -0.781172  1.409055  y  a


Key1 = y key2 = b
   dataset1  dataset2 k1 k2
3   0.69961    0.5774  y  b


Key1 = z key2 = a
   dataset1  dataset2 k1 k2
4 -0.670863 -1.566093  z  a

In [20]:
gr = dframe.groupby('k1')

In [21]:
gr.get_group('x')

   dataset1  dataset2 k1 k2
0 -0.158972 -0.888624  x  a
1 -1.191138 -0.924377  x  b

In [22]:
group_dict = dict(list(dframe.groupby('k1')))

In [23]:
group_dict['x']

   dataset1  dataset2 k1 k2
0 -0.158972 -0.888624  x  a
1 -1.191138 -0.924377  x  b

In [24]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))

In [25]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0 -0.158972 -0.888624
 1 -1.191138 -0.924377
 2 -0.781172  1.409055
 3  0.699610  0.577400
 4 -0.670863 -1.566093, dtype('O'):   k1 k2
 0  x  a
 1  x  b
 2  y  a
 3  y  b
 4  z  a}